In [1]:
import pandas as pd
import numpy as np

In [4]:
!ls -la ../data/

total 5692
drwxr-xr-x 17 501 dialout     544 Nov 22 15:52 .
drwxr-xr-x 12 501 dialout     384 Dec 16 19:51 ..
-rw-r--r--  1 501 dialout    6148 Nov 11 19:01 .DS_Store
-rw-r--r--  1 501 dialout   14751 Oct 31 21:47 Data.json
-rw-r--r--  1 501 dialout   72036 Nov  1 17:24 StudentsPerformance.csv
-rw-r--r--  1 501 dialout  583449 Nov  9 20:50 data.zip
-rw-r--r--  1 501 dialout 2055796 Nov  6 17:04 data_sf.xls
drwxr-xr-x 13 501 dialout     416 Nov  9 21:07 data_zip
-rw-r--r--  1 501 dialout   76805 Nov 10 17:47 log.csv
drwxr-xr-x  3 501 dialout      96 Nov 11 19:01 mod_1
-rw-r--r--  1 501 dialout  494431 Nov  9 17:37 movies.xls
-rw-r--r--  1 501 dialout     160 Nov  9 18:54 movies_example.txt
-rw-r--r--  1 501 dialout 2483723 Nov  9 17:39 ratings.xls
-rw-r--r--  1 501 dialout      54 Nov  9 18:54 ratings_example.txt
-rw-r--r--  1 501 dialout     526 Nov 10 18:05 sample.xls
-rw-r--r--  1 501 dialout    9729 Nov 22 15:51 tips.csv
-rw-r--r--  1 501 dialout    3875 Nov 10 17:47 users.csv

In [4]:
logs = pd.read_csv('../data/log.csv', header=None)
users = pd.read_csv('../data/users.csv', encoding='koi8_r', sep='\t')
logs.columns=['user_id', 'time', 'bet', 'win']

In [13]:
logs.loc[:, 1].isna().sum()

15

In [19]:
logs.dropna(subset=[0], axis=1)

                                    0                     1
0    Запись пользователя № - user_919  [2019-01-01 14:06:51
1    Запись пользователя № - user_973  [2019-01-01 14:51:16
2    Запись пользователя № - user_903  [2019-01-01 16:31:16
3    Запись пользователя № - user_954  [2019-01-01 17:17:51
4    Запись пользователя № - user_954  [2019-01-01 21:31:18
..                                ...                   ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58
996                            #error                   NaN
997                            #error                   NaN
998                            #error                   NaN
999                            #error                   NaN

[1000 rows x 2 columns]

In [23]:
logs.dropna(axis=0).shape

(133, 4)

In [26]:
logs.loc[:, [0, 1]].dropna(axis=1)

                                    0
0    Запись пользователя № - user_919
1    Запись пользователя № - user_973
2    Запись пользователя № - user_903
3    Запись пользователя № - user_954
4    Запись пользователя № - user_954
..                                ...
995  Запись пользователя № - user_984
996                            #error
997                            #error
998                            #error
999                            #error

[1000 rows x 1 columns]

In [27]:
logs.columns=['user_id', 'time', 'bet', 'win']
res = pd.concat([logs[['user_id', 'time']].dropna(axis=1), logs[['bet', 'win']]], axis=1)

In [30]:
res.isna()

     user_id    bet    win
0      False   True   True
1      False   True   True
2      False   True   True
3      False   True   True
4      False   True   True
..       ...    ...    ...
995    False  False   True
996    False  False  False
997    False  False   True
998    False  False   True
999    False  False   True

[1000 rows x 3 columns]

In [34]:
pd.isna(np.nan)

True

In [35]:
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
pd.isna(array)

array([[False,  True, False],
       [False, False,  True]])

In [5]:
display(logs.shape)
logs.drop_duplicates(subset=['user_id', 'time'])

(1000, 4)

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[986 rows x 4 columns]

In [13]:
def prepare_time(time: str) -> str:
    if time == time and time.startswith('['):
        return time[1::]
    else:
        return time

In [17]:
dates = logs.loc[:, 'time'].dropna(axis=0).apply(prepare_time)
display(dates.head())

0    2019-01-01 14:06:51
1    2019-01-01 14:51:16
2    2019-01-01 16:31:16
3    2019-01-01 17:17:51
4    2019-01-01 21:31:18
Name: time, dtype: object

In [22]:
max_date = pd.to_datetime(arg=dates, format='%Y-%m-%d %H:%M:%S').max()
max_date

Timestamp('2019-04-20 18:10:07')

In [26]:
max_date.strftime(format='%Y-%m-%d')

'2019-04-20'

In [74]:
log = pd.read_csv("../data/log.csv")
log.columns = ['user_id', 'time', 'bet', 'win'] 
log.dropna(subset=['time'])

dates = log.loc[:, 'time'].dropna(axis=0).apply(prepare_time)
dates = pd.to_datetime(arg=dates, format='%Y-%m-%d %H:%M:%S')

display(dates.head())

0   2019-01-01 14:51:16
1   2019-01-01 16:31:16
2   2019-01-01 17:17:51
3   2019-01-01 21:31:18
4   2019-01-01 23:34:55
Name: time, dtype: datetime64[ns]

In [75]:
dates.dt.minute.value_counts(ascending=False).head()

36    25
31    23
50    22
43    21
14    21
Name: time, dtype: int64

In [76]:
dates.dt.month.value_counts(ascending=True).head()

4    170
2    259
3    264
1    291
Name: time, dtype: int64

In [77]:
(dates.dt.dayofweek.isin([5, 6])).sum()

283

In [73]:
dates.dt.day_name().isin(['Sunday', 'Saturday']).sum()

283

In [70]:
dates.dt.day_name().value_counts()

Saturday     152
Wednesday    150
Tuesday      149
Friday       135
Monday       135
Thursday     132
Sunday       131
Name: time, dtype: int64

In [98]:
log = pd.read_csv("../data/log.csv")
log.columns = ['user_id', 'time', 'bet', 'win'] 
log.dropna(subset=['time'], inplace=True)
log.loc[:, 'time'] = log.loc[:, 'time'].apply(prepare_time)
log.loc[:, 'time'] = pd.to_datetime(arg=log.loc[:, 'time'], format='%Y-%m-%d %H:%M:%S')
log.loc[:, 'hour'] = log.loc[:, 'time'].dt.hour

log

,user_id,time,bet,win,hour
0,Запись пользователя № - user_973,2019-01-01 14:51:16,NaN,NaN,14
1,Запись пользователя № - user_903,2019-01-01 16:31:16,NaN,NaN,16
2,Запись пользователя № - user_954,2019-01-01 17:17:51,NaN,NaN,17
3,Запись пользователя № - user_954,2019-01-01 21:31:18,NaN,NaN,21
4,Запись пользователя № - user_917,2019-01-01 23:34:55,156789.0,NaN,23
...,...,...,...,...,...
990,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,12
991,Запись пользователя № - user_967,2019-04-20 14:59:36,10154.0,NaN,14
992,Запись пользователя № - user_973,2019-04-20 17:09:56,10254.0,NaN,17
993,Запись пользователя № - user_977,2019-04-20 18:10:07,10354.0,NaN,18
994,Запись пользователя № - user_984,2019-04-20 09:59:58,9754.0,NaN,9

In [87]:
def part_of_day(hour: int) -> str:
    if 0 <= hour <= 5:
        return 'ночь'
    elif 6 <= hour <=  11:
        return 'утро'
    elif 12 <= hour <=  17:
        return 'день'
    elif 18 <= hour <=  23:
        return 'вечер'
    else:
        return 'нельзя определеить'

In [94]:
log.loc[:, 'hour'].apply(part_of_day).value_counts(ascending=True)

вечер    227
день     239
утро     253
ночь     265
Name: hour, dtype: int64

In [100]:
import pandas as pd


def prepare_time(time: str) -> str:
    if time == time and time.startswith('['):
        return time[1::]
    else:
        return time
    

log = pd.read_csv("../data/log.csv", header=None)
log.columns = ['user_id', 'time', 'bet', 'win'] 
log.dropna(inplace=True)
log.loc[:, 'time'] = log.loc[:, 'time'].apply(prepare_time)
log.loc[:, 'time'] = pd.to_datetime(arg=log.loc[:, 'time'], format='%Y-%m-%d %H:%M:%S')
log.loc[:, 'hour'] = log.loc[:, 'time'].dt.hour

log

,user_id,time,bet,win,hour
14,Запись пользователя № - user_917,2019-01-02 08:57:36,145732.0,1987653.0,8
29,Запись пользователя № - user_942,2019-01-04 13:59:42,1678321.0,9876543.0,13
151,Запись пользователя № - user_982,2019-01-16 21:54:22,100.0,4749.0,21
189,Запись пользователя № - user_964,2019-01-21 18:34:44,200.0,4667.0,18
205,Запись пользователя № - user_931,2019-01-22 05:26:59,300.0,4319.0,5
...,...,...,...,...,...
967,Запись пользователя № - user_975,2019-04-19 22:25:15,1000.0,6108.0,22
971,Запись пользователя № - user_912,2019-04-20 10:35:49,10554.0,31799.0,10
972,Запись пользователя № - user_926,2019-04-20 10:35:50,10354.0,30244.0,10
976,Запись пользователя № - user_970,2019-04-20 10:35:54,10354.0,30691.0,10
991,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,12

In [161]:
log = pd.read_csv("../data/log.csv", header=None)
log.columns = ['user_id', 'time', 'bet', 'win'] 
display(log.describe())

                bet           win
count  4.850000e+02  1.380000e+02
mean   6.785738e+03  9.562102e+04
std    7.720292e+04  8.554669e+05
min    1.000000e+02  3.691000e+03
25%    3.000000e+02  5.096250e+03
50%    6.000000e+02  5.935000e+03
75%    9.000000e+02  6.978750e+03
max    1.678321e+06  9.876543e+06

In [103]:
log.loc[:, 'bet'] = log.loc[:, 'bet'].fillna(0)
(log.loc[:, 'bet'] == 0).sum()

515

In [162]:
def fillna_win(row):  
    if row['win'] == row['win'] and row['win'] > 0:
        return row['win']
    elif (row['win'] != row['win'] or row['win'] == 0) and row['bet'] > 0:
        return -row['bet']
    else:
        return 0

    
# заполним пустые значения признака 'bet'
log.loc[:, 'bet'] = log.loc[:, 'bet'].fillna(0)

# заполним пустые значения признака 'win'
log.loc[:, 'win'] = log.apply(lambda row: fillna_win(row), axis=1)

In [122]:
(log.loc[:, 'win'] < 0).sum()

347

In [168]:
log.query('win > 0')

,user_id,time,bet,win,net
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0,1841921.0
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0,8198222.0
151,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0,4649.0
189,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0,4467.0
205,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0,4019.0
...,...,...,...,...,...
981,#error,NaN,800.0,7035.0,6235.0
986,#error,NaN,10454.0,29972.0,19518.0
987,#error,NaN,10554.0,31634.0,21080.0
991,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0,6127.0
996,#error,NaN,10054.0,29265.0,19211.0

In [167]:
def fillna_net(row):  
    if row['win'] < 0:
        return row['win']
    else:
        return row['win'] - row['bet']
    
    
log.loc[:, 'net'] = log.apply(lambda row: fillna_net(row), axis=1)

In [169]:
(log.loc[:, 'net'] > 0).sum()

138

In [178]:
log.loc[log.loc[:, 'net'] > 0, 'net'].mean()

80253.33333333333

In [150]:
# Альтернативный подход из slack
log = pd.read_csv('../data/log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']
log.bet=log['bet'].fillna(0)
log.win=log['win'].fillna(0)
log['net']=log['win']-log['bet']
(log.net>0).sum()

138

In [171]:
log.loc[log.loc[:, 'net'] > 0, 'net'].median()

5347.0

Как можно посчитать среднее значение для столбца bet, не учитывая при подсчете пропуски?

In [179]:
log = pd.read_csv('../data/log.csv', header=None)
log.columns=['user_id', 'time', 'bet', 'win']

In [180]:
log.bet.mean()

6785.738144329897

In [186]:
log.bet.mean(skipna=True)

6785.738144329897

In [182]:
pd.mean(log['bet'])

AttributeError: module 'pandas' has no attribute 'mean'

In [183]:
log.bet.sum() / log.bet.dropna().shape[0]

6785.738144329897

In [184]:
np.mean(log.bet)

6785.738144329897

In [185]:
log['bet'].dropna().mean()

6785.738144329897